# AnalyticalMemberForceStartAllNonZero Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalMemberForceStartAllNonZero Property
ParameterTypeId Class See Also
---
"All non 0 forces at start"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalMemberForceStartAllNonZero { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalMemberForceStartAllNonZero As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalMemberForceStartAllNonZero {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace